In [1]:
import pandas as pd ; import numpy as np

In [2]:
sozlukVerisi={"İstanbul":[30,25,np.nan],"İzmir":[40,39,38],"Ankara":[25,np.nan,20]}
HavaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [3]:
HavaDurumuDataFrame

   İstanbul  İzmir  Ankara
0      30.0     40    25.0
1      25.0     39     NaN
2       NaN     38    20.0

In [4]:
nansizHavaDurumu=HavaDurumuDataFrame.dropna()
nansizHavaDurumu
# nan bulunduran satırları komple çıkarır.

   İstanbul  İzmir  Ankara
0      30.0     40    25.0

In [5]:
HavaDurumuDataFrame.dropna(axis=1)
# axis ile istediğimizi seçebilir 0=X , 1=y

   İzmir
0     40
1     39
2     38

In [6]:
yeniVeri={"İstanbul":[30,25,np.nan],"İzmir":[40,39,38],"Ankara":[25,np.nan,20],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)
yeniDataFrame

   İstanbul  İzmir  Ankara  Antalya
0      30.0     40    25.0     45.0
1      25.0     39     NaN      NaN
2       NaN     38    20.0      NaN

In [7]:
yeniDataFrame.dropna(axis=1 , thresh=2)

   İstanbul  İzmir  Ankara
0      30.0     40    25.0
1      25.0     39     NaN
2       NaN     38    20.0

In [8]:
yeniDataFrame.fillna(20)
# eksik olan yerlere 20 yazdık

   İstanbul  İzmir  Ankara  Antalya
0      30.0     40    25.0     45.0
1      25.0     39    20.0     20.0
2      20.0     38    20.0     20.0

## group by

In [9]:
maasSozlugu={"Departmanlar":["YAZILIM","YAZILIM","PAZARLAMA","PAZARLAMA","HUKUK","HUKUK"],
            "CalisanIsmi:":["Ahmet","Mehmet","Burak","Zeynep","Atıl","Fatma"],
             "Maas":[100,150,200,250,300,400]}

In [10]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [11]:
maasDataFrame

  Departmanlar CalisanIsmi:  Maas
0      YAZILIM        Ahmet   100
1      YAZILIM       Mehmet   150
2    PAZARLAMA        Burak   200
3    PAZARLAMA       Zeynep   250
4        HUKUK         Atıl   300
5        HUKUK        Fatma   400

In [13]:
grup=maasDataFrame.groupby("Departmanlar")

In [14]:
grup

In [15]:

grup.mean()

              Maas
Departmanlar
HUKUK          350
PAZARLAMA      225
YAZILIM        125

In [16]:
grup.count()

              CalisanIsmi:  Maas
Departmanlar
HUKUK                    2     2
PAZARLAMA                2     2
YAZILIM                  2     2

In [17]:
grup.describe()

              Maas
             count   mean        std    min    25%    50%    75%    max
Departmanlar
HUKUK          2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
PAZARLAMA      2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
YAZILIM        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0